ArduCAM/Energia/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/pcm.xml
<module id="PCM" HW_revision=""><register id="CTL0" width="32" offset="0x0" internal="0" description="Control 0 Register"><bitfield id="AMR" description="Active Mode Request" begin="3" end="0" width="4" rwaccess="R/W"><bitenum id="AMR__0" value="0" description="LDO based Active Mode at Core voltage setting 0."/><bitenum id="AMR__1" value="1" description="LDO based Active Mode at Core voltage setting 1."/><bitenum id="AMR__4" value="4" description="DC-DC based Active Mode at Core voltage setting 0."/><bitenum id="AMR__5" value="5" description="DC-DC based Active Mode at Core voltage setting 1."/><bitenum id="AMR__8" value="8" description="Low-Frequency Active Mode at Core voltage setting 0."/><bitenum id="AMR__9" value="9" description="Low-Frequency Active Mode at Core voltage setting 1."/></bitfield><bitfield id="LPMR" description="Low Power Mode Request" begin="7" end="4" width="4" rwaccess="R/W"><bitenum id="LPMR__0" value="0" description="LPM3"/><bitenum id="LPMR__16" value="10" description="LPM3.5. Core voltage setting 0."/><bitenum id="LPMR__18" value="12" description="LPM4.5"/></bitfield><bitfield id="CPM" description="Current Power Mode" begin="13" end="8" width="6" rwaccess="R/W"><bitenum id="CPM__0" value="0" description="LDO based Active Mode at Core voltage setting 0."/><bitenum id="CPM__1" value="1" description="LDO based Active Mode at Core voltage setting 1."/><bitenum id="CPM__4" value="4" description="DC-DC based Active Mode at Core voltage setting 0."/><bitenum id="CPM__5" value="5" description="DC-DC based Active Mode at Core voltage setting 1."/><bitenum id="CPM__8" value="8" description="Low-Frequency Active Mode at Core voltage setting 0."/><bitenum id="CPM__9" value="9" description="Low-Frequency Active Mode at Core voltage setting 1."/><bitenum id="CPM__22" value="16" description="LDO based LPM0 at Core voltage setting 0."/><bitenum id="CPM__23" value="17" description="LDO based LPM0 at Core voltage setting 1."/><bitenum id="CPM__32" value="20" description="DC-DC based LPM0 at Core voltage setting 0."/><bitenum id="CPM__33" value="21" description="DC-DC based LPM0 at Core voltage setting 1."/><bitenum id="CPM__36" value="24" description="Low-Frequency LPM0 at Core voltage setting 0."/><bitenum id="CPM__37" value="25" description="Low-Frequency LPM0 at Core voltage setting 1."/><bitenum id="CPM__50" value="32" description="LPM3"/></bitfield><bitfield id="KEY" description="PCM key" begin="31" end="16" width="16" rwaccess="R/W"/></register><register id="CTL1" width="32" offset="0x4" internal="0" description="Control 1 Register"><bitfield id="LOCKLPM5" description="Lock LPM5" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="LOCKLPM5__0" value="0" description="LPMx.5 configuration defaults to reset condition"/><bitenum id="LOCKLPM5__1" value="1" description="LPMx.5 configuration remains locked during LPMx.5 entry and exit"/></bitfield><bitfield id="LOCKBKUP" description="Lock Backup" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="LOCKBKUP__0" value="0" description="Backup domain configuration defaults to reset condition"/><bitenum id="LOCKBKUP__1" value="1" description="Backup domain configuration remains locked during LPM3"/></bitfield><bitfield id="FORCE_LPM_ENTRY" description="Bit selection for the application to determine whether the entr" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="FORCE_LPM_ENTRY__0" value="0" description="PCM aborts LPM3/LPMx"/><bitenum id="FORCE_LPM_ENTRY__1" value="1" description="PCM enters LPM3/LPMx"/></bitfield><bitfield id="PMR_BUSY" description="Power mode request busy flag" begin="8" end="8" width="1" rwaccess="R/W"/><bitfield id="KEY" description="PCM key" begin="31" end="16" width="16" rwaccess="R/W"/></register><register id="IE" width="32" offset="0x8" internal="0" description="Interrupt Enable Register"><bitfield id="LPM_INVALID_TR_IE" description="LPM invalid transition interrupt enable" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="LPM_INVALID_TR_IE__0" value="0" description="Disabled"/><bitenum id="LPM_INVALID_TR_IE__1" value="1" description="Enabled"/></bitfield><bitfield id="LPM_INVALID_CLK_IE" description="LPM invalid clock interrupt enable" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="LPM_INVALID_CLK_IE__0" value="0" description="Disabled"/><bitenum id="LPM_INVALID_CLK_IE__1" value="1" description="Enabled"/></bitfield><bitfield id="AM_INVALID_TR_IE" description="Active mode invalid transition interrupt enable" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="AM_INVALID_TR_IE__0" value="0" description="Disabled"/><bitenum id="AM_INVALID_TR_IE__1" value="1" description="Enabled"/></bitfield><bitfield id="DCDC_ERROR_IE" description="DC-DC error interrupt enable" begin="6" end="6" width="1" rwaccess="R/W"><bitenum id="DCDC_ERROR_IE__0" value="0" description="Disabled"/><bitenum id="DCDC_ERROR_IE__1" value="1" description="Enabled"/></bitfield></register><register id="IFG" width="32" offset="0xC" internal="0" description="Interrupt Flag Register"><bitfield id="LPM_INVALID_TR_IFG" description="LPM invalid transition flag" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="LPM_INVALID_CLK_IFG" description="LPM invalid clock flag" begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="AM_INVALID_TR_IFG" description="Active mode invalid transition flag" begin="2" end="2" width="1" rwaccess="R/W"/><bitfield id="DCDC_ERROR_IFG" description="DC-DC error flag" begin="6" end="6" width="1" rwaccess="R/W"/></register><register id="CLRIFG" width="32" offset="0x10" internal="0" description="Clear Interrupt Flag Register"><bitfield id="CLR_LPM_INVALID_TR_IFG" description="Clear LPM invalid transition flag" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="CLR_LPM_INVALID_CLK_IFG" description="Clear LPM invalid clock flag" begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="CLR_AM_INVALID_TR_IFG" description="Clear active mode invalid transition flag." begin="2" end="2" width="1" rwaccess="R/W"/><bitfield id="CLR_DCDC_ERROR_IFG" description="Clear DC-DC error flag." begin="6" end="6" width="1" rwaccess="R/W"/></register></module>